{
  "cards": {
    "start": [
      "Start - Getting to where you need",
      "Maybe you already have some steps done and can skip some things in this guide.",
      ["My Wii isn't softmodded (has no Homebrew Channel)",
      "I have  Homebrew Channel installed",
      "I can do USB Loading"]
    ],
    "updating": [
      "Updating your Wii",
      "Go into the Wii settings and update your Wii. You need an internet connection for this. Check if your Wii is version 4.3 after this.",
      ["My Wii is now updated to 4.3",
      "I can't connect my Wii to the internet or i have a different error."]
    ],
    "fresh-start": [
      "Fresh Start: Checking your Wii version",
      "In this step we'll check what Wii system menu version your Wii is running and how to update if needed.",
      ["I don't know what version my Wii has",
      "My Wii is running version 4.3",
      "My Wii is running anything below 4.3"]
    ],
    "find-wii-version": [
      "Finding your Wii version",
      "In order to find your Wii version you need to go into Settings -> Wii System and you should see your Wii system version at the top right of the screen. The letter at the end tells you which region the Wii is from. U is USA, E is Europe (and Australia and some parts of South America), J is Japane and K is Korea.<br/>If it says 4.3, then your Wii is up to date. If it's lower, it's outdated",
      ["My version starts with 4.3",
      "My version does not start with 4.3"]
    ],
    "updating2": [
      "Updating your Wii",
      "Go into the Wii settings and update your Wii. You need an internet connection for this. Check if your Wii is version 4.3 after this.",
      ["My Wii is now updated to 4.3",
      "I can't connect my Wii to the internet or i'm getting an error",
      "Parental Access is preventing me from updating or setting up an internet connection"]
    ],
    "letterbomb": [
      "Using Letterbomb to install the Homebrew Channel",
      "Now we'll be using Letterbomb to actually softmod your Wii and install the Homebrew channel (and BootMii)."
    ],
    "prepare-sd": [
      "Preparing your SD card",
      ""
    ],
    "prepare-usb": [
      "Preparing your USB device",
      "Put the Brawl ISO on your FAT32 formatted USB device (min. 8GB, max 2TB partition) using the wbfs_file tool"
    ]
  }
}