{
  "title": "Homebrewing your Wii",
  "cards": {
    "start": {
      "title": "Step 1 - Introduction",
      "text": "This guide will show you how you can \"homebrew\" your Wii. This will allow you to launch small programs that we'll use to install and run Project M from your SD card very easily without needing to use an exploit every time.   \nHowever to get to that part, we need to use one of these exploits in the first place. Luckily there a bunch of options listed here for every Wii system version and there a lot more out there as well."
    },
    "sd-check": {
      "title": "Step 1b - SD compatibility",
      "text": "Even though the Wii on version 4.0 and higher supports the vast majority of SD cards, including a lot of Micro-SD cards with an adapter, you can easily check if your Wii supports your SD card.\nSimply format your SD card as FAT32, go to the Wii home menu and insert the SD card. If the SD card logo in the bottom left lights up blue, your card is compatible.\n\nDon't know which SD card to use / buy? Generally people have had most success with SDHC cards from 8 up to 32GB, like [these](https://www.amazon.com/SanDisk-Class-SDHC-Flash-Memory/dp/B00FM5E1EY/ref=sr_1_3?s=electronics&ie=UTF8&qid=1545947891&sr=1-3&keywords=sd+card+8gb) (not affiliate link, not sponsored by amazon.com).",
      "choices": {
        "version": "My SD card is getting detected",
        "str2hax-1": "I don't want to use an SD card right now"
      }
    },
    "version": {
      "title": "Step 2 - Finding your Wii's system version",
      "text": "The easiest SD-based exploits are **LetterBomb for 4.3** and **BannerBomb for 4.2** (BannerBomb v2) and **3.0-4.1** (BannerBomb v1), since they don't require a game exploit like *Twilight Hack* or *SmashStack*.   \nPlease go into your settings and check what system version your Wii has.",
      "choices": {
        "letterbomb-1": "4.3",
        "bannerbomb-v2": "4.2",
        "bannerbomb-v1": "3.0-4.1",
        "smashstack-1": "Below 3.0"
      }
    },
    "letterbomb-1": {
      "title": "Step 2.2 (LetterBomb) - Finding your Wii's MAC adress",
      "text": "LetterBomb works on all latest (4.3) Wii system versions, but it requires your Wii's MAC adress to work. This is a code that is unique for every Wii and while it is mainly used for internet connectivity, your Wii doesn't need an internet connection for this to work. Every Wii has this MAC adress even without ever being connected to the internet.   \nTo find this adress, go to the **Wii settings**, then **internet**, and then **information**.   \nYou don't need to write this down, but keep the screen open for the next step."
    },
    "letterbomb-2": {
      "title": "Step 2.3 (LetterBomb) - Downloading the exploit and the Homebrew channel",
      "text": "Now you need to go to [please.hackmii.com](https://please.hackmii.com/) and enter your MAC adress there. Make sure you select the right region! (You can find it in your system settings at the top).   \nAlso check **Bundle Hackmii installer for me** and cut any of the two wires (doesn't matter which one)",
      "choices": {
        "letterbomb-3": "I got the LetterBomb.zip file downloaded",
        "wiibrand": "The website is down"
      }
    },
    "letterbomb-3": {
      "title": "Step 2.4 (LetterBomb) - Moving LetterBomb to your SD card",
      "text": "Now you need to backup any files you want to keep on your SD card because we need to format it.   \nIf your done, format the SD card with the **FAT32** filesystem and the biggest **Allocation Size** or **Block Size** that you can choose. Check **Quick format** and format the SD card.   \nOn Windows you can find the format option when you right click your SD card inside **This PC** (also called **My Computer** on older Windows versions). For other operating systems you should be able to find instructions online.   \nOnce the formatting is done, open the **LetterBomb.zip** file and copy all contents to the root of your SD card."
    },
    "letterbomb-4": {
      "title": "Step 2.5 (LetterBomb) - Using LetterBomb to run the HackMii installer",
      "text": "Once the file transfer is done (shouldn't take long) go to the Wii home menu and insert your SD card. The SD icon should light up blue which signlizes that the Wii can read the card.   \nNow go to the **Message Board** which is on the bottom right and usually keeps track of your gaming stats. You should be able to see a red letter with a bomb icon (LetterBomb logo) either today, yesterday or the day before yesterday.   \nIf you don't see it, make sure your Wii's date is set correctly (time doesn't need to be super accurate).   \nOpen the letter and the screen should turn black and some white text should run across it. You'll see a disclaimer message, more info on the next card."
    },
    "bannerbomb-v2": {
      "title": "Step 2.2 (BannerBomb) - BannerBomb for Wii system version 4.2",
      "text": "Start with a clean, FAT32 formatted SD card.   \n1. Download [this file](/downloads/bannerbomb/BannerBomb_v2_abd6a.zip).\n2. Put it in the root of your SD card\n3. Don't plug in your SD card yet\n4. Open the SD menu from the Wii home menu (SD icon at the bottom).\n5. Insert the SD card.\nYou should see **Load boot.dol/elf?**\n6. Choose **Yes**.   \n######[Source / More info](https://bannerbomb.qoid.us/index.new.php)   \n"
    },
    "bannerbomb-v1": {
      "title": "Step 2.2 (BannerBomb) - BannerBomb for Wii system version 3.0 up to 4.1",
      "text": "Start with a clean, FAT32 formatted SD card.   \n1. Download [this file]().\n2. Put it in the root of your SD card."
    },
    "smashstack-1": {
      "title": "Using your Brawl copy for installing the Homebrew channel",
      "text": "placeholder"
    },
    "smashstack-2": {
      "title": "Smashstack 2 title",
      "text": "placeholder"
    },
    "wilbrand": {
      "title": "Step 2.3b (LetterBomb) - Using Wilbrand instead of [please.hackmii.com](https://please.hackmii.com)",
      "text": "Oh no! [please.hackmii.com](http://please.hackmii.com) is down? Don't worry, there's another way without the need of a specific game.   \n*Wilbrand* does essentially the same as using the website.   \n1. Download *Wilbrand*. ([GitHub](https://github.com/giantpune/mailboxbomb)) ([Direct Windows Download](https://github.com/giantpune/mailboxbomb/blob/master/Wilbrand.exe?raw=true))\n2. Open a command window where the executable file lies. On Windows you can Shift + Rightclick in the explorer window and either start CMD or PowerShell.\n3. Type in the command with this syntax: `Wilbrand <MAC> <Date> <System-Version> <SD-Root>`.   \nExample: `Wilbrand Wilbrand.exe 12-34-56-78-90-12 04/29/2019 4.3e G:`"
    },
    "str2hax-1": {
      "title": "Step 2.1 (str2hax): Changing the Wii's DNS",
      "text": "1. Go to the **Wii settings**\n2. Open **Internet** and then **Connection Settings**\n3. Choose your active connection\n4. Select **Change settings** and scroll to the right until you get to **Auto-Obtain DNS**\n5. Select **No**, then select **Advanced Settings**\n6. Change the **Primary DNS** to **216.69.185.14** and the **Secondary DNS** to **173.201.71.14**\n7. Select **Confirm** and then **Save**. You'll be prompted to make a connection test. (Select **No** to the system update prompt). If the connection test doesn't work try running it one more time and if it still fails, please leave a post on the forum post linked at the bottom of this card. (Please make sure you have a working internet connection in the first place)   \n######[Source / Forum post](https://gbatemp.net/threads/a-channel-less-sd-less-entry-point-str2hax.523210/)   \n"
    },
    "str2hax-2": {
      "title": "Step 2.2 (str2hax): Loading the exploit",
      "text": "1. Back out to the **Internet** panel and choose **User Agreements**. Select **Yes** to the question about the Wii Shop channel/WiiConnect24\n2. You'll be taken to a screen telling you to review the User Agreements for the Wii. Select **Next**\n3. If you see a pony screen telling you to wait you've done everything correctly. The exploit takes 1-2 minutes and if it takes longer than 2 minutes it probably failed. Just turn off your Wii and start again from step 1 on this page.   \nAfter a minute of two you should be booted into the HackMii installer. If the Wii freezes with a bunch of white text, please make a post with a **readable** picture of the screen in the forum post linked below.   \nIf this exploit helped you, you can donate some money to the creator Fullmetal5 [here](https://paypal.me/DexterGerig).   \n######[Source / Forum post](https://gbatemp.net/threads/a-channel-less-sd-less-entry-point-str2hax.523210/)   \n"
    },
    "hackmii-1": {
      "title": "Step 3.1: Installing the Homebrew channel",
      "text": "The HackMii installer always starts with a 30 second disclaimer and warning screen about scam dangers.   \nDon't worry, just wait the 30 seconds and then press 1 on your Wiimote to continue. Now you should be in the Hackmii installer menu.\n1. Choose **Continue**.\n2. Choose **Install The Homebrew Channel**.\n3. Select **Yes, continue**.\n4. After a moment it should say **SUCCESS** in green, press **Continue**.   \nYou're now back at the main menu."
    },
    "hackmii-2": {
      "title": "Step 3.2 (optional): Installing BootMii (requires SD card)",
      "text": "This step is optional but ***highly recommended*** and requires a Wii-compatible SD-card (if you're already using LetterBomb or BannerBomb, you can use your current SD-card).\n1. Select **BootMii...**\n2. Now depending on when your Wii was manufactured or if it was in repair at Nintendo you might have different options on this screen.   \nIf you have the option **Install BootMii as boot2**, choose it, otherwise choose **Install BootMii as IOS** (should always be available).\n3. Insert an SD card if you haven't already and choose **Yes, continue**\n4. Choose **Yes, continue** again to install BootMii.\nInstallation to *boot2* might take a few moments.\n5. When you see **SUCCESS** in green, choose **Continue**.\n6. Select **Return to the main menu**.\n7. Select **Exit**. You should be brought to the Homebrew channel.   \nYou can launch it from the Wii home menu and if you need to, you can always simply uninstall it from the Wii settings."
    }
  }
}